init.org
#+title: Configuration file
#+auto_tangle: t

todo :
- police fira mono
- all-the-icons-install-fonts ? comment faire ?

* Introduction

** How this file works
:PROPERTIES:
:ID:       c4f1d90a-3afd-4884-af24-8134fb163535
:END:

This file is provided with the git repository: any updates (see the readme for update instructions) will reset this file as intended. Therefore, modifying it is pointless. However, to customize it, see [[id:c9bd19aa-b1c5-4d96-b4d9-1fb09aaedae8][How to modify the configuration]].

*** Basic Code Block

This is a basic example of a code block in Org mode. Code blocks are enclosed in "#+begin_src" and "#+end_src" tags. The language of the code block (e.g., emacs-lisp) is specified right after "#+begin_src".

#+begin_src emacs-lisp
  ;; Simple function definition in Emacs Lisp
    (message "Hello, world!")
#+end_src

This block does not interact with any external files or parts of the document. It's simply an isolated snippet of code that you can run within Org mode. Do C-c C-c when you are in this block !

Bonus for programmer : this can work with any type of language (":results output" will print the result of the console, and not the return value)

#+begin_src python :results output

print("Hello word")

#+end_src

*** Tangling Code Block

The following code block has a ":tangle yes" directive. This tells Org mode to include this code in a source file when the document is tangled. Tangling is the process of extracting code blocks into a standalone script or source file, which can be executed outside of Emacs.

#+begin_src emacs-lisp :tangle yes
  ;; the code in this code block and ALL code block with ":tangle yes" will be exported
#+end_src

By tangling, you can maintain your source code within an Org document but still produce executable scripts, making your documentation and code management more integrated and fluid (like this config file).

*** Noweb Reference Definition Block

This block defines a ":noweb-ref" called "test". The ":noweb-ref" is a marker that allows this block of code to be referenced by name in other parts of the document.

#+begin_src emacs-lisp :noweb-ref test
  ;; Code that can be reused in other blocks
  (defun repeat-message (message)
    (dotimes (i 3)
      (message message)))
#+end_src

You can think of ":noweb-ref" as creating a reusable code snippet that can be inserted into other code blocks using the "noweb" syntax.

*** Using Noweb to Insert Code

The ":noweb yes" directive allows the inclusion of code from a ":noweb-ref block". This means that the "<<test>>" here is replaced by the content of the "test" block defined earlier.
Don't forget the ":tangle yes" if you want to export the code too (not the case here) !

#+begin_src emacs-lisp :noweb yes
    ;; Here we insert all the ":noweb-ref test" block
    <<test>>

    ;; Additional code can be added here too
    (repeat-message "Hello again!")
#+end_src

This feature is powerful for literate programming because it lets you define code in chunks that can be explained in context and reused throughout the document.

*** Summary

Remember, any change to a block with ":tangle" or ":noweb-ref" has broader implications for your document's behavior and the output files. It's essential to manage these carefully, especially in a collaborative environment where the document might be sourced from a version-controlled repository.

* Configuration of Emacs and his world

** Basic things essential

*** Startup Page

Here is the code allowing to start with the Tutorial.

#+begin_src emacs-lisp :tangle yes

  (defun open-my-startup-file ()
    "Open a specific file and maximize the Emacs window on startup."
    (find-file (concat user-emacs-directory "PKM/notes/" "tutorial.org"))  ; Change the path to your specific file
    (delete-other-windows))

  ;; Add the custom startup function to the Emacs startup hook
  (add-hook 'emacs-startup-hook 'open-my-startup-file)

#+end_src

*** Package Manager

#+begin_src emacs-lisp :tangle early-init.el

  ;; Disable package.el in favor of straight.el
  (setq package-enable-at-startup nil)

#+end_src

#+begin_src emacs-lisp  :tangle yes

;; Install straight.el
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name
        "straight/repos/straight.el/bootstrap.el"
        (or (bound-and-true-p straight-base-dir)
            user-emacs-directory)))
      (bootstrap-version 7))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

#+end_src

*** Use-package

#+begin_src emacs-lisp :tangle yes

  ;; Install use-package
  (when (version< emacs-version "29")
    (straight-use-package 'use-package))

  ;; always download package automatically (without :ensure t)
  (setq use-package-always-ensure t)

  ;; Configure use-package to use straight.el by default
  (setq straight-use-package-by-default t)

#+end_src

*** Keep .emacs.d clean

#+begin_src emacs-lisp :tangle yes 

  (use-package no-littering
	       :init
	       (require 'no-littering)
	       )

#+end_src

*** Variable of the PKM

#+begin_src emacs-lisp :tangle yes 

  (defgroup eepkm nil
    "Customization group for EasyEmacsPKM"
    :group 'main-group  ; Inherits from main-group
    :prefix "eepkm-"
    )


#+end_src

*** Encodings

#+begin_src emacs-lisp :tangle yes

;;; Encodings
;; Contrary to what many Emacs users have in their configs, you don't need more
;; than this to make UTF-8 the default coding system:
(set-language-environment "UTF-8")
;; ...but `set-language-environment' also sets `default-input-method', which is
;; a step too opinionated.
(setq default-input-method nil)
;; ...And the clipboard on Windows could be in a wider encoding (UTF-16), so
;; leave Emacs to its own devices.
(when (memq system-type '(cygwin windows-nt ms-dos))
  (setq selection-coding-system 'utf-8))

#+end_src


*** Leave with Escape key

To replace the classic "C-g".

#+begin_src emacs-lisp :tangle yes 

  ;; make esc key do cancel. works only in gui emacs
  (define-key key-translation-map (kbd "<escape>") (kbd "C-g"))
  ;; the first don't work with all the time
  (define-key key-translation-map (kbd "ESC") (kbd "C-g"))


#+end_src


** Text

*** Aesthetics

**** Wraps lines

visual-line-mode is a display mode in Emacs that wraps lines of text at the edge of the window. This mode is particularly useful for reading and editing long paragraphs of text because it allows the lines to break naturally at word boundaries without inserting hard newline characters into the text.

#+begin_src emacs-lisp :tangle yes

  ;; visuellement
  (global-visual-line-mode 1)

#+end_src

**** Fill mode

(auto-fill-mode 1)
fill-column

*** Smart parens

#+begin_src emacs-lisp :tangle yes 

(use-package smartparens
    :hook (org-mode . smartparens-mode)
    :config
    (sp-pair "\«" "\»")  
    ;; the second argument is the closing delimiter, so you need to skip it with nil
    (sp-pair "'" nil :actions :rem)  
    (sp-local-pair 'org-mode "*" "*") ;; adds * as a local pair in org mode
    (sp-local-pair 'org-mode "=" "=") ;; adds = as a local pair in org mode
    (sp-local-pair 'org-mode "\/" "\/")
    )

#+end_src


*** Auto save

#+begin_src emacs-lisp :tangle yes 

  (auto-save-visited-mode 1)
  (setq auto-save-visited-interval 10) ; every X seconds


#+end_src

*** Normal copy and past shortcut

CUA Mode is a feature in Emacs that configures the keybindings to emulate the Common User Access (CUA) standard used in many other programs, particularly those in the Windows environment. This mode makes cut, copy, paste, and other common operations accessible through the familiar Ctrl-X, Ctrl-C, Ctrl-V, and Ctrl-Z shortcuts.

#+begin_src emacs-lisp :tangle yes 

(cua-mode 1)

#+end_src


*** Replace text when copy and past

** Aesthetics

*** Mode line

#+begin_src emacs-lisp :tangle yes 

  (use-package doom-modeline
	       :init
	       (doom-modeline-mode)
	       :custom    
	       (doom-modeline-height 25)
	       (doom-modeline-bar-width 1)
	       (doom-modeline-icon t)
	       (doom-modeline-major-mode-icon t)
	       (doom-modeline-major-mode-color-icon t)
	       (doom-modeline-buffer-file-name-style 'truncate-upto-project)
	       (doom-modeline-buffer-state-icon t)
	       (doom-modeline-buffer-modification-icon t)
	       (doom-modeline-minor-modes nil)
	       (doom-modeline-enable-word-count t)
	       (doom-modeline-buffer-encoding nil)
	       (doom-modeline-indent-info nil)
	       (doom-modeline-checker-simple-format t)
	       (doom-modeline-vcs-max-length 20)
	       (doom-modeline-env-version t)
	       (doom-modeline-irc-stylize 'identity)
	       (doom-modeline-github-timer nil)
	       (doom-modeline-gnus-timer nil)
	       )

#+end_src

*** Icons

#+begin_src emacs-lisp :tangle yes 

  (use-package all-the-icons-dired)

  (add-hook 'dired-mode-hook 'all-the-icons-dired-mode)

#+end_src

*** Scroll bar

:tangle yes 
#+begin_src emacs-lisp

  (scroll-bar-mode 0)

  (use-package better-scroll-bar
	       :straight
	       (:host github :repo "jcs-elpa/better-scroll-bar")
	       :init
	       (define-key global-map (kbd "<prior>") #'better-scroll-down)
	       (define-key global-map (kbd "<next>") #'better-scroll-up)

	       (define-key global-map (kbd "S-<prior>") #'better-scroll-down-other-window)
	       (define-key global-map (kbd "S-<next>") #'better-scroll-up-other-window)
	       )

  (use-package auto-scroll-bar
	       :straight
	       (:host github :repo "jcs-elpa/auto-scroll-bar")
	       :init
	       (auto-scroll-bar-mode 1)
	       )

#+end_src

*** Cursor

**** View where is the cursor

Not very useful.

#+begin_src emacs-lisp

  (use-package beacon
      :config
      (setq beacon-blink-delay 0.0)
      (setq beacon-blink-duration 0.5)
      (setq beacon-size 60)
      ;; (setq beacon-color "#ffa38f")
      (setq beacon-color "blue")
      (beacon-mode 1)
      )

#+end_src

**** Indication in the modeline

#+begin_src emacs-lisp :tangle yes 

  (use-package nyan-mode
      :init (nyan-mode)
      )

#+end_src

*** Theme

#+begin_src emacs-lisp :tangle yes 

  (use-package doom-themes
	       :config
	       ;; (load-theme 'doom-moonlight t)
	       (load-theme 'leuven t)
	       )

#+end_src

*** Buffer

**** Light active buffer

Not very useful.

#+begin_src emacs-lisp

(use-package dimmer
    :custom
    (dimmer-fraction 0.3)
    (dimmer-exclusion-regexp-list
     '(".*Minibuf.*"
       ".*which-key.*"
       ".*LV.*"))
    :config
    (dimmer-mode 1)
    )

#+end_src

** Human-machine interface

*** Interface for shortcut / keybinding

#+begin_src emacs-lisp :tangle yes :noweb yes 

  (use-package hydra)

  (use-package pretty-hydra
	       :init
	       <<pretty-hydra-init>>
	       )

  (defgroup eepkm-bindings nil
    "Customization subgroup for key bindings"
    :group 'eepkm  
    )

#+end_src

**** Menu
:PROPERTIES:
:ID:       4be934ad-9e75-4b45-a0b1-adb6d26a8632
:END:

