init.el
	     
	     ;; Customizable key bindings for PKM section
	     (defcustom eepkm-bindings-find-node-key "f"
	       "Key for `org-roam-node-find` in the eepkm-bindings PKM section."
	       :type 'string
	       :group 'eepkm-bindings)
	     
	     (defcustom eepkm-bindings-insert-node-key "i"
	       "Key for `org-roam-node-insert` in the eepkm-bindings PKM section."
	       :type 'string
	       :group 'eepkm-bindings)
	     
	     (defcustom eepkm-bindings-attach-key "a"
	       "Key for `org-attach` in the eepkm-bindings PKM section."
	       :type 'string
	       :group 'eepkm-bindings)
	     
	     ;; Customizable key bindings for Note section
	     (defcustom eepkm-bindings-note-new-heading-key "h"
	       "Key for `org-meta-return` in the eepkm-bindings Note section."
	       :type 'string
	       :group 'eepkm-bindings)
	     
	     (defcustom eepkm-bindings-note-todo-key "t"
	       "Key for `org-todo` in the eepkm-bindings Note section."
	       :type 'string
	       :group 'eepkm-bindings)
	     
	     (defcustom eepkm-bindings-note-export-key "e"
	       "Key for `org-export-dispatch` in the eepkm-bindings Note section."
	       :type 'string
	       :group 'eepkm-bindings)
	     
	     (defcustom eepkm-bindings-note-store-link-key "l"
	       "Key for `org-store-link` in the eepkm-bindings Note section."
	       :type 'string
	       :group 'eepkm-bindings)
	     
	     (defcustom eepkm-bindings-note-insert-link-key "m"
	       "Key for `org-insert-link` in the eepkm-bindings Note section."
	       :type 'string
	       :group 'eepkm-bindings)
	     
	     ;; Customizable key bindings for Window section
	     (defcustom eepkm-bindings-window-split-horizontally-key "h"
	       "Key for `split-window-below` in the eepkm-bindings Window section."
	       :type 'string
	       :group 'eepkm-bindings)
	     
	     (defcustom eepkm-bindings-window-split-vertically-key "v"
	       "Key for `split-window-right` in the eepkm-bindings Window section."
	       :type 'string
	       :group 'eepkm-bindings)
	     
	     (defcustom eepkm-bindings-window-next-window-key "n"
	       "Key for `next-window` in the eepkm-bindings Window section."
	       :type 'string
	       :group 'eepkm-bindings)
	     
	     (defcustom eepkm-bindings-window-previous-window-key "p"
	       "Key for `previous-window` in the eepkm-bindings Window section."
	       :type 'string
	       :group 'eepkm-bindings)
	     
	     (defcustom eepkm-bindings-window-winner-undo-key "w"
	       "Key for `winner-undo` in the eepkm-bindings Window section."
	       :type 'string
	       :group 'eepkm-bindings)
	     
	     (defcustom eepkm-bindings-window-winner-redo-key "x"
	       "Key for `winner-redo` in the eepkm-bindings Window section."
	       :type 'string
	       :group 'eepkm-bindings)
	     
	     (defcustom eepkm-bindings-window-delete-other-windows-key "k"
	       "Key for `delete-other-windows` in the eepkm-bindings Window section."
	       :type 'string
	       :group 'eepkm-bindings)
	     
	     (defcustom eepkm-bindings-window-delete-window-key "d"
	       "Key for `delete-window` in the eepkm-bindings Window section."
	       :type 'string
	       :group 'eepkm-bindings)
	     
	     
	     )

(defgroup eepkm-bindings nil
  "Customization subgroup for key bindings"
  :group 'eepkm  
  )

(defcustom eepkm-bindings-menu "<f11>"
  ;; (kbd "<escape>")
  ;; (kbd "C-c h")
  "Key for `org-roam-node-find` in the eepkm-bindings PKM section."
  :type 'string
  :group 'eepkm-bindings)

(global-set-key (kbd eepkm-bindings-menu) 'eepkm-bindings/body)

;; hydra-keyboard-quit
(eval
 `(pretty-hydra-define eepkm-bindings
    (:title "Main Commands of the PKM" :color amaranth :quit-key "ESC" :exit t)
    ("PKM"
     ((,eepkm-bindings-find-node-key org-roam-node-find "Find and go to a node")
      (,eepkm-bindings-insert-node-key org-roam-node-insert "Find and insert a link to a node")
      (,eepkm-bindings-attach-key org-attach "Attach a document to the heading"))
     "Note"
     ((,eepkm-bindings-note-new-heading-key org-meta-return "Insert new heading or list")
      (,eepkm-bindings-note-todo-key org-todo "Mark a heading as TODO")
      (,eepkm-bindings-note-export-key org-export-dispatch "Export to another format")
      (,eepkm-bindings-note-store-link-key org-store-link "Store the link under the cursor")
      (,eepkm-bindings-note-insert-link-key org-insert-link "Insert a link"))
     "Window"
     ((,eepkm-bindings-window-split-horizontally-key split-window-below "Split your window horizontally")
      (,eepkm-bindings-window-split-vertically-key split-window-right "Split your window vertically")
      (,eepkm-bindings-window-next-window-key next-window "Next window")
      (,eepkm-bindings-window-previous-window-key previous-window "Previous window")
      (,eepkm-bindings-window-winner-undo-key winner-undo "Undo previous configuration of window(s)")
      (,eepkm-bindings-window-winner-redo-key winner-redo "Redo previous configuration of window(s)")
      (,eepkm-bindings-window-delete-other-windows-key delete-other-windows "Keep only the current window")
      (,eepkm-bindings-window-delete-window-key delete-window "Delete current window")))))

(use-package which-key
	     :init
	     (which-key-mode)
	     :config
	     (setq which-key-idle-delay 0.5)  ; Adjust to the desired delay in seconds before which-key pops up
	     (setq which-key-popup-type 'side-window)  ; Display in side window by default
	     (setq which-key-side-window-location 'bottom)  ; Display at the bottom of the screen
	     (setq which-key-side-window-max-width 0.33)  ; Use a third of the screen width for which-key window
	     (setq which-key-side-window-max-height 0.25)  ; Use a quarter of the screen height for which-key window
	     (which-key-setup-side-window-bottom)  ; Setup to display at the bottom
	     )

;; vertical completion
(use-package vertico
	     :init
	     (vertico-mode 1)
	     :custom
	     (vertico-cycle t)
	     ;; :custom-face
	     ;; (vertico-current ((t (:background "#3a3f5a"))))
	     )

;; annotation in the minibuffer
(use-package marginalia
	     :init
	     (marginalia-mode 1)
	     :custom
	     (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
	     )

;; Use the `orderless' completion style.
;; Use space-separated search terms in any order when completing with Icomplete or the default interface.
;; Example : M-x consult-line, write "use ordeless", and you will find the configuration of the package orderless !
(use-package orderless
	     :init
	     ;; Enable `partial-completion' for files to allow path expansion.
	     ;; You may prefer to use `initials' instead of `partial-completion'.
	     (setq completion-styles '(orderless)
		   completion-category-defaults nil
		   completion-category-overrides '((file (styles partial-completion)))))

;; better searching 
(use-package consult
	     :config
	     ;; Replace bindings with Consult commands
	     (global-set-key (kbd "C-s") 'consult-line)
	     (global-set-key (kbd "C-x b") 'consult-buffer)
	     (global-set-key (kbd "M-y") 'consult-yank-pop)
	     (global-set-key [remap switch-to-buffer] 'consult-buffer)
	     (global-set-key [remap switch-to-buffer-other-window] 'consult-buffer-other-window)
	     (global-set-key [remap switch-to-buffer-other-frame] 'consult-buffer-other-frame))

(winner-mode 1)

(use-package org :straight (org :type git :repo "https://code.orgmode.org/bzg/org-mode.git")
	     :config
	     (setq org-directory (concat user-emacs-directory "PKM/notes/"))
	     )
