init.org
**** Exportation

#+begin_src emacs-lisp :tangle yes 

  (defun my/org-export-output-dir (orig-fun &rest args)
    "Modification of the export-output directory for Org-mode."
    (let ((old-default-directory default-directory))
      ;; Change working directory temporarily to 'export' directory.
      (setq default-directory (expand-file-name "PKM/data/export/" user-emacs-directory))
      (apply orig-fun args)
      ;; Restores original working directory after export.
      (setq default-directory old-default-directory)))

  ;; Applies directory modification function to all Org export functions.
  (advice-add 'org-export-to-file :around #'my/org-export-output-dir)

#+end_src


**** Aesthetic

***** Global

#+begin_src emacs-lisp :tangle yes 

  ;;Pour obtenir des polices proportionnelles
  (variable-pitch-mode 1)

  ;; Make sure org-indent face is available
  (require 'org-indent)
  ;; (set-face-attribute 'org-document-title nil :font "Fira Mono" :weight 'bold :height 1.5)
  ;; (dolist (face '((org-level-1 . 1.3)
  ;;                 (org-level-2 . 1.25)
  ;;                 (org-level-3 . 1.20)
  ;;                 (org-level-4 . 1.15)
  ;;                 (org-level-5 . 1.10)
  ;;                 (org-level-6 . 1.05)
  ;;                 (org-level-7 . 1.0)
  ;;                 (org-level-8 . 1.0)))
  ;;   (set-face-attribute (car face) nil :font "Fira Mono" :weight 'medium :height (cdr face)))


  ;; ;; Ensure that 
  ;; anything that should be fixed-pitch in Org files appears that way
  (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-table nil  :inherit 'fixed-pitch)
  (set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
  (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-indent nil :inherit '(org-hide fixed-pitch))
  (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)

  ;;couleur des checkbox
  (defface org-checkbox-todo-text
    '((t (:inherit org-todo)))
    "Face for the text part of an unchecked org-mode checkbox.")

  (font-lock-add-keywords
   'org-mode
   `(("^[ \t]*\\(?:[-+*]\\|[0-9]+[).]\\)[ \t]+\\(\\(?:\\[@\\(?:start:\\)?[0-9]+\\][ \t]*\\)?\\[\\(?: \\|\\([0-9]+\\)/\\2\\)\\][^\n]*\n\\)" 1 'org-checkbox-todo-text prepend))
   'append)

  (defface org-checkbox-done-text
    '((t (:inherit org-done)))
    "Face for the text part of a checked org-mode checkbox.")

  (font-lock-add-keywords
   'org-mode
   `(("^[ \t]*\\(?:[-+*]\\|[0-9]+[).]\\)[ \t]+\\(\\(?:\\[@\\(?:start:\\)?[0-9]+\\][ \t]*\\)?\\[\\(?:X\\|\\([0-9]+\\)/\\2\\)\\][^\n]*\n\\)" 1 'org-checkbox-done-text prepend))
   'append)

#+end_src


***** New symbol end of headings

#+begin_src emacs-lisp :tangle yes 

  (setq org-ellipsis "⬎")

#+end_src

***** Indentation

#+begin_src emacs-lisp :tangle yes 

  (add-hook 'org-mode-hook 'org-indent-mode)

#+end_src


**** Attach

#+begin_src emacs-lisp :tangle yes 

  (setq org-attach-dir (concat user-emacs-directory "PKM/data/org-attach"))

  ;; each attached document go to the ID of the nodes

  ;;The first function in this list defines the preferred function which will be used when creating new attachment folders.
  (setq org-attach-id-to-path-function-list
	'(cp/org-attach-id-uuid-folder-format
	  ;; org-attach-id-uuid-folder-format
	  ))

  (defun cp/org-attach-id-uuid-folder-format (id)
    "Return the path to attach a file with an id"
    (format "%s" id))


#+end_src

*** Org-roam

#+begin_src emacs-lisp :tangle yes

  (use-package org-roam
	       :init
	       (setq org-roam-directory org-directory)
	       ;;avoid nottif from version 1 to 2
	       (setq org-roam-v2-ack t)
	       :custom
	       (org-roam-completion-everywhere t) ;; to have completion everywhere
	       ;;set my log capture, not used
	       (org-roam-dailies-directory "journals/")
	       ;; what's in the backlinks buffer
	       (org-roam-mode-sections
		(list #'org-roam-backlinks-section
		      #'org-roam-reflinks-section
		      #'org-roam-unlinked-references-section
		      ))
	       :config
	       (setq org-roam-directory org-directory)
	       ;; automatic sync with files 
	       (org-roam-db-autosync-mode +1)
	       )

#+end_src


*** Org-roam-ui

#+begin_src emacs-lisp :tangle yes

(use-package org-roam-ui
    :after org-roam
    :straight
    (:host github :repo "org-roam/org-roam-ui" :branch "main" :files ("*.el" "out"))
    ;; :hook (after-init . org-roam-ui-mode)
    :config
    (setq org-roam-ui-sync-theme t
          org-roam-ui-follow t
          org-roam-ui-update-on-save t
          org-roam-ui-open-on-start nil)
    )

#+end_src

*** Org-consult

#+begin_src emacs-lisp :tangle yes

(use-package consult-org-roam
   :after org-roam
   :init
   (require 'consult-org-roam)
   ;; Activate the minor mode
   (consult-org-roam-mode 1)
   :custom
   ;; Use `ripgrep' for searching with `consult-org-roam-search'
   (consult-org-roam-grep-func #'consult-ripgrep)
   ;; Display org-roam buffers right after non-org-roam buffers
   ;; in consult-buffer (and not down at the bottom)
   (consult-org-roam-buffer-after-buffers t)
   :bind
   ;; Define some convenient keybindings as an addition
   ("C-c n e" . consult-org-roam-file-find)
   ("C-c n b" . consult-org-roam-backlinks)
   ("C-c n B" . consult-org-roam-backlinks-recursive)
   ("C-c n l" . consult-org-roam-forward-links)
   ("C-c n r" . consult-org-roam-search))

#+end_src

** Dired

#+begin_src emacs-lisp :tangle yes 

  ;;to directly delete the buffer if a file (or directory) is deleted
  (defun my--dired-kill-before-delete (file &rest rest)
    (if-let ((buf (get-file-buffer file)))
	(kill-buffer buf)
      (dolist (dired-buf (dired-buffers-for-dir file))
	(kill-buffer dired-buf))))
  (advice-add 'dired-delete-file :before 'my--dired-kill-before-delete)



					  ; automatic refresh of dired when file is modified
  (add-hook 'dired-mode-hook 'auto-revert-mode)

  (setq dired-auto-revert-buffer t) ; ; Update dired buffer on revisit
  (setq dired-dwim-target t) ; ; If two dired buffers are open, save in the other on copy attempt
  (setq dired-hide-details-hide-symlink-targets nil) ; ; Do not hide symlink targets
  (setq dired-listing-switches "-alh") ; ; Allow dired to display all folders, in lengty format, with quantities of data in human-readable format
  (setq dired-ls-F-marks-symlinks nil) ; ; Informs dired how 'ls -lF' marks symbolic links, see help page for details
  (setq dired-recursive-copies 'always) ; ; Always recursively copies without prompting
  (setq dired-recursive-deletes 'always) ; asks for more to delete recursively
  (setq dired-dwim-target t) ; qd t-on copies, if another dired is open, copies into it "directly".

#+end_src


** Other

* How to modify the configuration
:PROPERTIES:
:ID:       c9bd19aa-b1c5-4d96-b4d9-1fb09aaedae8
:END:

[[elisp:(find-file (concat user-emacs-directory "personal.org"))][Go to personal configuration file]].

You don't have the option to create another configuration file, as the base file will always be overwritten. Therefore, I've decided to create a second configuration file where you can simply copy and paste code snippets that suit your needs !

Load the personal configuration file.

#+begin_src emacs-lisp :tangle yes

  (load (concat user-emacs-directory "personal.el"))

#+end_src

And load the personal option via customize :

#+begin_src emacs-lisp :tangle yes

    (customize-set-variable 'custom-file (no-littering-expand-etc-file-name "custom.el"))

    ;; after-init-hook ?
    (when (file-exists-p custom-file)
      (load custom-file nil 'nomessage))

  ;; (add-hook 'after-init-hook (lambda ()
  ;; 				    (if (file-exists-p custom-file)
  ;; 					(load custom-file nil 'nomessage)
  ;; 				      (message "Le fichier de configuration custom-file [%s] n'existe pas" custom-file))))

#+end_src
